# -*- coding:utf-8 -*-
__author__ = 'Harrison'

# 统一管理系统内所有redis的键名

#########################################################################
# user_center
#########################################################################



#########################################################################
# mall
#########################################################################
# 商户信息  type -> hash
key_shop_info = "mall:shop:{shop_id}"



########################################################################
# 权限系统
########################################################################



#########################################################################
# GPS相关
#########################################################################
# 最新的GPS记录
key_deliver_last_gps = 'gps:last_gps:{user_id}'


########################################################################
# 账户系统
########################################################################
# type -> hash set, field 'total_cost'
# 账户消费统计数据
key_account_cost_statistic_data = 'account:{owner_id}:cost:statistic_data'
# 账户充值统计数据
key_account_charge_statistic_data = 'account:{owner_id}:charge:statistic_data'
# 商户账户锁
key_account_lock = "finance:account:{account_id}:lock"


#########################################################################
# 短信相关
#########################################################################
# 控制短信发送频率
key_sms_rate_limit = "sms:rate:{tel}"
# 短信验证码
key_sms_code = "sms:code:{tel}"


#########################################################################
# 其他
#########################################################################
# type -> str
key_token = "token:{content}"
# type -> hash
key_area_code = u"area:province:{province_name}:city:{city_name}:district:{district_name}"
# type -> str 接口调用计数器
key_api_call_count = 'api:count:{method}:{url}'
# type -> str 日志中心-API调用记录
key_api_call_record = 'log_center:api:record'
